andrimarjonsson/ArduinoMega32/boards.txt

megadev.name=ATMega32 Dev Board 8MHz

megadev.upload.tool=avrdude
megadev.upload.protocol=stk500v2
megadev.upload.maximum_size=32768
megadev.upload.maximum_data_size=2048
megadev.upload.speed=115200

megadev.bootloader.tool=avrdude
megadev.bootloader.low_fuses=0xE4
megadev.bootloader.high_fuses=0xD9

megadev.build.mcu=atmega32
megadev.build.f_cpu=8000000L
megadev.build.core=arduino
megadev.build.variant=mega32
